import React, { useEffect, useState } from "react";
import Faq from "react-faq-component";
import FaqArrow from '../../assets/images/icons/faq-arrow.svg'

const index = () => {
  const data = {
    rows: [
      {
        title: <h3 className="faq__content-title">"Ҳокимининг ёрдамчиси ким ва қандай ишлар билан шуғулланади?"</h3>,
        content: <p className="faq__content-desc">Ҳокимининг ёрдамчиси ҳар бир шаҳарча, қишлоқ, овулда, шунингдек, шаҳарлар, шаҳарчалар, қишлоқлар ҳамда овуллардаги ҳар бир маҳаллада тадбиркорликни ривожлантириш, аҳоли бандлигини таъминлаш ва камбағалликни қисқартириш масалалари бўйича ишлар олиб боради</p>
      },
      {
        title: <h3 className="faq__content-title">Ҳоким ёрдамчиларининг ойлик иш ҳақи қанча миқдорда белгиланган?</h3>,
        content: <p className="faq__content-desc">Ҳоким ёрдамчиларининг ойлик иш ҳақи миқдори улар бириктирилган маҳалладаги хонадонлар сонига мутаносиб равишда қуйидагича белгиланади. Хонадонлар сони 500 тагача бўлган маҳаллада — меҳнатга ҳақ тўлашнинг энг кам миқдорининг 6 баравари миқдорида; хонадонлар сони 501 тадан 1 000 тагача бўлган маҳаллада — меҳнатга ҳақ тўлашнинг энг кам миқдорининг 6,5 баравари миқдорида. Хонадонлар сони 1 000 тадан ортиқ бўлган маҳаллада — меҳнатга ҳақ тўлашнинг энг кам миқдорининг 7 баравари миқдорида.</p>
      },
      {
        title: <h3 className="faq__content-title">Ҳоким ёрдамчилари ўз вазифаларини амалга оширишда фойдаланадиган молиявий инструментларнинг 2022 йил учун манбалари қанча миқдорда белгиланган?</h3>,
        content: <p className="faq__content-desc">Ҳоким ёрдамчилари ўз вазифаларини амалга оширишда фойдаланадиган молиявий инструментларнинг 2022 йил учун манбалари этиб қуйидагилар белгилансин: а) оилавий тадбиркорликни ривожлантириш дастурлари доирасида ажратиладиган кредитлар — 10 трлн сўм; б) аҳолининг бандлигини таъминлаш, уларнинг ўзини ўзи банд қилиши, шунингдек, тадбиркорлик фаолиятини йўлга қўйиши учун ажратиладиган маблағлар — 1 218 млрд сўм, шундан: Бандликка кўмаклашиш давлат жамғармасидан иш билан банд бўлмаган аҳолига тадбиркорлик қилиш ва ўзини ўзи банд қилиш учун субсидиялар, кредит ресурслари ва бошқа харажатлар учун — 785 млрд сўм, иш билан банд бўлмаган аҳолини касб-ҳунарга, тадбиркорлик ва ҳунармандчиликка ўқишга йўналтириш учун — 210 млрд сўм; Жамоат ишлари жамғармасидан ишсиз аҳолини ҳақ тўланадиган жамоат ишларига жалб этиш харажатлари учун — 222 млрд сўм; в) Фермер, деҳқон хўжаликлари ва томорқа ер эгаларини қўллаб-қувватлаш жамғармаси ҳисобидан ажратиладиган субсидиялар — 50 млрд сўм; г) Ҳоким ёрдамчилари тавсиялари асосида маҳалла инфратузилмасини яхшилаш учун кўзда тутиладиган маблағлар — 250 млрд сўм; д) «Саховат ва кўмак» жамғармаси, «Аёллар дафтари» жамғармаси, «Ёшлар дафтари» жамғармаси — 851 млрд сўм миқдорида.</p>
      },
      {
        title: <h3 className="faq__content-title">Бошқа ҳудудлардан келиб ишлаётган Ҳоким ёрдамчилари ва республика вакиллари учун қандай имтиёзлар мавжуд?</h3>,
        content: <p className="faq__content-desc">Бошқа ҳудудлардан келиб ишлаётган Ҳоким ёрдамчилари ва республика вакиллари учун базавий ҳисоблаш миқдорининг икки баравари миқдорида турар жой ижараси харажатлари учун компенсация тўлаш. Иш фаолиятида яхши натижаларга эришган Ҳоким ёрдамчилари ва республика вакилларини ҳар ой мукофотлаш. Ҳоким ёрдамчилари иш ҳақининг аввалги иш жойи бўйича ўртача ойлик иш ҳақи миқдоридан кам бўлган қисмини компенсация қилиб бориш. Ўз шахсий автомобилидан фойдаланаётган республика вакилларининг транспорт харажатлари, шунингдек, бир ойда бир маротаба доимий яшаш жойига темир йўл транспортида бориб келиши учун компенсация тўлаш. 5. Йил якуни бўйича ўзига бириктирилган ҳудудда юқори натижаларга эришган республика вакилларига ва Ҳоким ёрдамчиларига ипотека кредити асосида уй-жой харид қилиш учун уй-жой қийматининг 50 фоизигача субсидия тўлаш.</p>
      },
    ],
  };

  const styles = {
    // bgColor: 'white',
    titleTextColor: "blue",
    rowTitleColor: "blue",
    rowContentColor: 'grey',
    arrowColor: "white",
  };
  const config = {
    animate: true,
    arrowIcon: ``,
    tabFocus: true
  };

  return (
    <>
      <section className="faq-main">
        <div className="container">
          <div className="faq">
            <span>F.A.Q</span>
            <h2 className="faq__title">Кўп бериладиган саволлар</h2>
            <p>
              Ҳар бир шаҳарча, қишлоқ, овулда, шунингдек, шаҳарлар, шаҳарчалар,
              қишлоқлар ҳамда овуллардаги ҳар бир маҳаллада тадбиркорликни
              ривожлантириш, аҳоли бандлигини таъминлаш ва камбағалликни
              қисқартириш масалалари бўйича туман (шаҳар) Ҳокимининг ёрдамчиси
              лавозимига боғлиқ бўлган саволларга жавоблар
            </p>
            <div className="faq__content">
              <Faq data={data} styles={styles} config={config} />
            </div>
          </div>
        </div>
      </section>
    </>
  );
};

export default index;
